Repository: hade-allaila/solar_power
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Hello
ar: مرحباً

source: change language
ar: تغيير اللغة

source: Settings
ar: الاعدادات

source: Home
ar: الرئيسية

source: Add Load
ar: اضافة حمل

source: English
ar: الانكليزية

source: Arabic
ar: العربية

source: Load List
ar: الاحمال الحالية

# gridPowerDraw
source: grid Power
ar: استطاعة الشبكة

source: Battery Percent
ar: نسبة البطارية

source: Solar Power
ar: الطاقة الشمسية

# housePower
source: Home Power
ar: استطاعة المنزل

source: Load Name
ar: اسم الحمل

source: Load Priority
ar: أولوية الحمل

source: Load Pin
ar: مأخذ الحمل

source: Load Power
ar: استطاعة الحمل

source: Min On Time
ar: وقت التشغيل الاصغري

source: Max On Time
ar: وقت التشغيل الاعظمي

source: Min Off Time
ar: وقت الاطفاء الاصغري

source: Max Off Time
ar: وقت الاطفاء الاعظمي

# emptyFeildError
source: This feild cann't be empty
ar: هذا الحقل لا يمكن أن يكون فارغ

# loadAdded
source: Load has added successfully
ar: تم اضافة الحمل بنجاح

source: ok
ar: موافق

# connectionLost
source: Connection lost to the system, please check the IP address
ar: لقد فقد الاتصال بالمتحكم , تحقق من ال ip وحاول مجددا

source: ReConnect
ar: اعادة الاتصال

# notConnected
source: Sorry but you can't add load if you are not connected to the board
ar: لايمكنك اضافة حمل وانت غير متصل بالمتحكم قم بالاتصال وحاول مجددا
